app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jon@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_email(login_params[:email])

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jon@gmail.com"], ["LIMIT", 1]]
---
  def authorize_request
    #raise "Invalid Request"

    if request.headers['Authorization']
      begin
        data = JWT.decode(request.headers['Authorization'].gsub("Bearer ", ""), ApplicationController::SECRET_KEY)[0]
        @current_user = User.where(email: data["email"]).take!