app/controllers/favorites_controller.rb

  def index
    @favorites = current_user.favorites.map(&:data)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]

  def create
    @favorite = current_user.favorites.new(favorite_params)

    if @favorite.save
---
INSERT INTO "favorites" ("volcano_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["volcano_id", 2], ["user_id", 1], ["created_at", "2020-04-14 21:18:32.825635"], ["updated_at", "2020-04-14 21:18:32.825635"]]

  def destroy
    @favorite.destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 3]]

    def set_favorite
      @favorite = Favorite.find(params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]