app/controllers/volcanos_controller.rb

SELECT "volcanos".* FROM "volcanos"
---
  def index
    @volcanos = Volcano.all

UPDATE "volcanos" SET "name" = $1, "image_url" = $2, "location" = $3, "updated_at" = $4 WHERE "volcanos"."id" = $5
---
  def update
    if @volcano.update(volcano_params)

SELECT "volcanos".* FROM "volcanos" WHERE "volcanos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_volcano
      @volcano = Volcano.find(params[:id])